Autodesk.Revit.DB.Structure.RebarCoverTypeSet
A set that contains RebarCover types.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.Insert(Autodesk.Revit.DB.Structure.RebarCoverType)
System.Int32
Insert the specified RebarCover type into the set.
item: The RebarCover type to be inserted into the set.
Returns: Returns whether the RebarCover type was inserted into the set.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.RebarCoverTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.RebarCoverTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.Erase(Autodesk.Revit.DB.Structure.RebarCoverType)
System.Int32
Removes a specified RebarCover type from the set.
item: The RebarCover type to be erased.
Returns: The number of RebarCover types that were erased from the set.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.Contains(Autodesk.Revit.DB.Structure.RebarCoverType)
System.Boolean
Tests for the existence of a RebarCover type within the set.
item: The RebarCover type to be searched for.
Returns: The Contains method returns True if the RebarCover type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.Clear
void
Removes every RebarCover type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.Size
System.Int32
get
Returns the number of RebarCover types that are in the set.

Autodesk.Revit.DB.Structure.RebarCoverTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.